In [1]:
#Pandas is an opensource library built on top of NumPy used in Data Cleaning and Data Analysis , it also has visualisation
# tools and it works with Data forms and different sourcces 
# ............ HOW to INSTALL PANDAS .............
#       conda install pandas

In [2]:
#Series are main datatypes, they are very similar to Arrays in NumPy but the difference is that series have the index:
import numpy as np
import pandas as pd

In [3]:
#The following we define different Data containers to show you how we can define a Serie and study the differences

In [4]:
char = ['a','b','c']
num = [11,12,13]
arr= np.array(num)
arr

array([11, 12, 13])

In [5]:
dictionary = {'a':11,'b':12,'c':13}
#by shift + tab you can see what are the parameters of Series as well as Index
pd.Series(data=num)

0    11
1    12
2    13
dtype: int64

In [6]:
pd.Series(data=num , index=char)

a    11
b    12
c    13
dtype: int64

In [7]:
#another way to create a seri is to pass a Numpy array or Dictionary to it(same as creating an array by passing a list to it)
pd.Series(num)

0    11
1    12
2    13
dtype: int64

In [8]:
pd.Series(dictionary)

a    11
b    12
c    13
dtype: int64

In [9]:
#grabbing information from Series
Ser1= pd.Series([1,2,3],['A','B','C'])
Ser2= pd.Series([4,5,6],['B','C','E'])

In [10]:
#the operations are based on the indexes :
Ser1+Ser2

A    NaN
B    6.0
C    8.0
E    NaN
dtype: float64

In [11]:
# ............................................ Data Frames .................................
# Data Frames are the main tool while working with Pandas in Data Frames we have Rows and Columns, and each column is a 
# Pandas Series :
from numpy.random import  randn
dataf= pd.DataFrame(randn(4,3), ['A','B','C','D'], ['L','M','N'])
dataf

          L         M         N
A  0.371646  0.317005  1.829760
B -0.042402 -0.324534  1.024389
C  1.718637  1.032121  0.571888
D -0.534978  1.130398 -1.553557

In [12]:
#to grb info from Data Frame :
dataf['M']

A    0.317005
B   -0.324534
C    1.032121
D    1.130398
Name: M, dtype: float64

In [13]:
#infact Roes and Columns in a Dataframe are Series
type(dataf['M'])

pandas.core.series.Series

In [14]:
#you can also grab a multiple columns by passing a list of column names:
dataf[['L','N']]

          L         N
A  0.371646  1.829760
B -0.042402  1.024389
C  1.718637  0.571888
D -0.534978 -1.553557

In [15]:
#to create a new Column to a Data Frame :
dataf['NEW']=[1,2,3,4]
dataf

          L         M         N  NEW
A  0.371646  0.317005  1.829760    1
B -0.042402 -0.324534  1.024389    2
C  1.718637  1.032121  0.571888    3
D -0.534978  1.130398 -1.553557    4

In [16]:
#to remove a column you can use drop and pass in the actual column name, you should also give it the axis which is
# by default 0 (and is pointing to the lables or Rows, so for droping columns we should specify it):
dataf.drop('NEW', axis=1)

          L         M         N
A  0.371646  0.317005  1.829760
B -0.042402 -0.324534  1.024389
C  1.718637  1.032121  0.571888
D -0.534978  1.130398 -1.553557

In [17]:
# ******* drop is that it is not inplace *********
dataf

          L         M         N  NEW
A  0.371646  0.317005  1.829760    1
B -0.042402 -0.324534  1.024389    2
C  1.718637  1.032121  0.571888    3
D -0.534978  1.130398 -1.553557    4

In [18]:
#So we still need to specifies the inplace argument to be TRUE :
dataf.drop('NEW', axis=1 , inplace=True)

In [19]:
dataf

          L         M         N
A  0.371646  0.317005  1.829760
B -0.042402 -0.324534  1.024389
C  1.718637  1.032121  0.571888
D -0.534978  1.130398 -1.553557

In [20]:
# How to grab ROWS in DataFrames?
# there are 2 ways rto do so and for both ways you need methods:
#  1. loc (it takes a lable ) 
#  2. iloc(this one is based on the index positions)
dataf.loc['A']

L    0.371646
M    0.317005
N    1.829760
Name: A, dtype: float64

In [21]:
dataf.iloc[0]

L    0.371646
M    0.317005
N    1.829760
Name: A, dtype: float64

In [22]:
# For selecting subset of Rows and Columns fo a Dataframe we aso need to use loc:
dataf.loc[['A','B'],'N']

A    1.829760
B    1.024389
Name: N, dtype: float64